In [13]:
import pandas as pd
from collections import OrderedDict, defaultdict

In [3]:
data = pd.read_csv('post_process_nov19.csv', index_col= 0)
data

,name,city,industry,yyyymmdd,lat,long
0,SoftBank,"Tokyo, Tokyo, Japan",2,1981/09/03,35.677769,139.764636
1,Citigroup,"New York, New York, United States",2,1998/10/08,40.712728,-74.006015
2,Compass,"New York, New York, United States",1,2012/10/04,40.712728,-74.006015
3,Facebook,"Menlo Park, California, United States",3,2004/02/04,37.451967,-122.177993
4,Reliance Retail,"Mumbai, Maharashtra, India",3,2006/01/01,18.938771,72.835335
...,...,...,...,...,...,...
995,Kraft Heinz,"Mendota, Minnesota, United States",10,2015/07/02,44.887188,-93.164387
996,Zocdoc,"New York, New York, United States",4,2007/09/18,40.712728,-74.006015
997,Infobip,"London, England, United Kingdom",1,2006/01/01,51.507322,-0.127647
998,Pluralsight,"Farmington, Utah, United States",8,2004/01/01,40.980442,-111.887469
999,Rebel,"São Paulo, Sao Paulo, Brazil",2,2016/01/01,-23.550651,-46.633382

In [48]:
pdf = pd.pivot_table(data, index = 'city', columns = 'industry', values = 'lat', aggfunc=['count'])
pdf

                                             count                           \
industry                                        1    2    3    4    5    6
city
Altrincham, Cheshire, United Kingdom           NaN  NaN  NaN  1.0  NaN  NaN
American Fork, Utah, United States             NaN  NaN  NaN  NaN  1.0  NaN
Amsterdam, Noord-Holland, The Netherlands      1.0  3.0  1.0  NaN  NaN  NaN
Ann Arbor, Michigan, United States             NaN  NaN  NaN  NaN  1.0  NaN
Armonk, New York, United States                NaN  NaN  NaN  NaN  NaN  NaN
...                                            ...  ...  ...  ...  ...  ...
Wilmington, North Carolina, United States      NaN  1.0  NaN  NaN  NaN  NaN
Winston Salem, North Carolina, United States   1.0  NaN  NaN  NaN  NaN  NaN
Woodland Hills, California, United States      1.0  NaN  NaN  NaN  NaN  NaN
Zug, Zug, Switzerland                          1.0  NaN  NaN  NaN  NaN  1.0
Zürich, Zurich, Switzerland                    NaN  2.0  NaN  1.0  NaN  NaN


industry                                       7   8    9   10   11
city
Altrincham, Cheshire, United Kingdom          NaN NaN  NaN NaN  NaN
American Fork, Utah, United States            NaN NaN  NaN NaN  NaN
Amsterdam, Noord-Holland, The Netherlands     NaN NaN  NaN NaN  1.0
Ann Arbor, Michigan, United States            NaN NaN  NaN NaN  NaN
Armonk, New York, United States               1.0 NaN  NaN NaN  NaN
...                                           ...  ..  ...  ..  ...
Wilmington, North Carolina, United States     NaN NaN  NaN NaN  NaN
Winston Salem, North Carolina, United States  NaN NaN  NaN NaN  NaN
Woodland Hills, California, United States     NaN NaN  NaN NaN  NaN
Zug, Zug, Switzerland                         NaN NaN  NaN NaN  NaN
Zürich, Zurich, Switzerland                   NaN NaN  1.0 NaN  NaN

[265 rows x 11 columns]

In [56]:
pdf.loc[:]

                                             count                           \
industry                                        1    2    3    4    5    6
city
Altrincham, Cheshire, United Kingdom           NaN  NaN  NaN  1.0  NaN  NaN
American Fork, Utah, United States             NaN  NaN  NaN  NaN  1.0  NaN
Amsterdam, Noord-Holland, The Netherlands      1.0  3.0  1.0  NaN  NaN  NaN
Ann Arbor, Michigan, United States             NaN  NaN  NaN  NaN  1.0  NaN
Armonk, New York, United States                NaN  NaN  NaN  NaN  NaN  NaN
...                                            ...  ...  ...  ...  ...  ...
Wilmington, North Carolina, United States      NaN  1.0  NaN  NaN  NaN  NaN
Winston Salem, North Carolina, United States   1.0  NaN  NaN  NaN  NaN  NaN
Woodland Hills, California, United States      1.0  NaN  NaN  NaN  NaN  NaN
Zug, Zug, Switzerland                          1.0  NaN  NaN  NaN  NaN  1.0
Zürich, Zurich, Switzerland                    NaN  2.0  NaN  1.0  NaN  NaN


industry                                       7   8    9   10   11
city
Altrincham, Cheshire, United Kingdom          NaN NaN  NaN NaN  NaN
American Fork, Utah, United States            NaN NaN  NaN NaN  NaN
Amsterdam, Noord-Holland, The Netherlands     NaN NaN  NaN NaN  1.0
Ann Arbor, Michigan, United States            NaN NaN  NaN NaN  NaN
Armonk, New York, United States               1.0 NaN  NaN NaN  NaN
...                                           ...  ..  ...  ..  ...
Wilmington, North Carolina, United States     NaN NaN  NaN NaN  NaN
Winston Salem, North Carolina, United States  NaN NaN  NaN NaN  NaN
Woodland Hills, California, United States     NaN NaN  NaN NaN  NaN
Zug, Zug, Switzerland                         NaN NaN  NaN NaN  NaN
Zürich, Zurich, Switzerland                   NaN NaN  1.0 NaN  NaN

[265 rows x 11 columns]

In [22]:
data.loc[data["city"] =='Tokyo, Tokyo, Japan']

,name,city,industry,yyyymmdd,lat,long
0,SoftBank,"Tokyo, Tokyo, Japan",2,1981/09/03,35.677769,139.764636
112,Playco,"Tokyo, Tokyo, Japan",1,2020/01/01,35.677769,139.764636
173,NEC Corporation,"Tokyo, Tokyo, Japan",6,1899/07/17,35.677769,139.764636

In [19]:
def city_count(dat)

265

In [28]:
cols = ['city','industry']
data[cols]

                                      city  industry
0                      Tokyo, Tokyo, Japan         2
1        New York, New York, United States         2
2        New York, New York, United States         1
3    Menlo Park, California, United States         3
4               Mumbai, Maharashtra, India         3
..                                     ...       ...
995      Mendota, Minnesota, United States        10
996      New York, New York, United States         4
997        London, England, United Kingdom         1
998        Farmington, Utah, United States         8
999           São Paulo, Sao Paulo, Brazil         2

[1000 rows x 2 columns]

In [42]:
data[cols][:]

                                      city  industry
0                      Tokyo, Tokyo, Japan         2
1        New York, New York, United States         2
2        New York, New York, United States         1
3    Menlo Park, California, United States         3
4               Mumbai, Maharashtra, India         3
..                                     ...       ...
995      Mendota, Minnesota, United States        10
996      New York, New York, United States         4
997        London, England, United Kingdom         1
998        Farmington, Utah, United States         8
999           São Paulo, Sao Paulo, Brazil         2

[1000 rows x 2 columns]

In [45]:
data[cols].iloc[3]

city        Menlo Park, California, United States
industry                                        3
Name: 3, dtype: object

In [40]:
for i in range(len(data)):
    data[cols].iloc[i]

city
industry

In [ ]:
# new colname = cty_counts, ind_in_cty_counts

In [20]:
data['city'].unique()

array(['Tokyo, Tokyo, Japan', 'New York, New York, United States',
       'Menlo Park, California, United States',
       'Mumbai, Maharashtra, India', 'Berlin, Berlin, Germany',
       'San Francisco, California, United States',
       'Philadelphia, Pennsylvania, United States',
       'London, England, United Kingdom',
       'Minneapolis, Minnesota, United States',
       'Hangzhou, Zhejiang, China',
       'Amsterdam, Noord-Holland, The Netherlands',
       'Bangalore, Karnataka, India', 'Beijing, Beijing, China',
       'Cupertino, California, United States',
       'Espoo, Southern Finland, Finland', 'Oslo, Oslo, Norway',
       'Exeter, Devon, United Kingdom', 'Ottawa, Ontario, Canada',
       'San Mateo, California, United States',
       'Boston, Massachusetts, United States',
       'Paris, Ile-de-France, France', 'Shenzhen, Guangdong, China',
       'Sunnyvale, California, United States',
       'Redmond, Washington, United States',
       'Santa Monica, California, United States',
       'Jerusalem, Yerushalayim, Israel',
       'Stockholm, Stockholms Lan, Sweden',
       'Moscow, Moscow City, Russian Federation',
       'Los Gatos, California, United States',
       'Mountain View, California, United States',
       'New Delhi, Delhi, India', 'Seattle, Washington, United States',
       'Brooklyn, New York, United States',
       'São Paulo, Sao Paulo, Brazil',
       'Mexico City, Distrito Federal, Mexico',
       'Leverkusen, Nordrhein-Westfalen, Germany',
       'Bengaluru, Karnataka, India', 'Miami, Florida, United States',
       'Santa Clara, California, United States',
       'Emeryville, California, United States',
       'Chicago, Illinois, United States',
       'Palo Alto, California, United States',
       'Cambridge, Massachusetts, United States',
       'Nashua, New Hampshire, United States', 'Dublin, Dublin, Ireland',
       'Boulder, Colorado, United States', 'Munich, Bayern, Germany',
       'Shanghai, Shanghai, China', 'Basel, Basel-Stadt, Switzerland',
       'Kormangala, Karnataka, India',
       'Kenilworth, New Jersey, United States',
       'Toronto, Ontario, Canada', "Taipei, T'ai-pei, Taiwan",
       'Cape Town, NA - South Africa, South Africa',
       'San Diego, California, United States',
       'Berkeley, California, United States', 'Delhi, Delhi, India',
       'Singapore, Central Region, Singapore',
       'Zürich, Zurich, Switzerland', 'Noida, Uttar Pradesh, India',
       'Monument, Colorado, United States', 'Waterloo, Ontario, Canada',
       'Irvine, California, United States',
       'Altrincham, Cheshire, United Kingdom',
       'Purchase, New York, United States', 'Tel Aviv, Tel Aviv, Israel',
       'Kent, Washington, United States', 'Poznan, Wielkopolskie, Poland',
       'Helsinki, Southern Finland, Finland',
       'Columbus, Ohio, United States',
       'San Jose, California, United States',
       'Culver City, California, United States',
       'New Orleans, Louisiana, United States',
       'Quarry Bay, Hong Kong Island, Hong Kong',
       'Fort Mill, South Carolina, United States',
       'Pittsburgh, Pennsylvania, United States',
       'Grand Cayman, Midland, Cayman Islands',
       'Montreuil-sous-bois, Ile-de-France, France',
       'Montréal, Quebec, Canada', 'Cincinnati, Ohio, United States',
       'Vienna, Wien, Austria', 'Vancouver, British Columbia, Canada',
       'Bangkok, Krung Thep, Thailand', 'Tempe, Arizona, United States',
       'Brisbane, California, United States',
       'Pleasanton, California, United States',
       'Hawthorne, California, United States',
       'Rochester, Minnesota, United States',
       'Frisco, Texas, United States',
       'Mill Valley, California, United States',
       'Sydney, New South Wales, Australia',
       'Montevideo, NA - Uruguay, Uruguay',
       'South San Francisco, California, United States',
       'Madrid, Madrid, Spain', "Seoul, Seoul-t'ukpyolsi, South Korea",
       'Waltham, Massachusetts, United States',
       'Englewood, Colorado, United States',
       'Tel Aviv-yafo, Tel Aviv, Israel',
       'Santa Barbara, California, United States',
       'Barcelona, Catalonia, Spain', 'Baar, Zug, Switzerland',
       'Denver, Colorado, United States', 'Istanbul, Istanbul, Turkey',
       'Manchester, Manchester, United Kingdom',
       'Taguig, Rizal, Philippines',
       'Stuttgart, Baden-Wurttemberg, Germany',
       'South Jordan, Utah, United States',
       'Short Hills, New Jersey, United States',
       'Bellevue, Washington, United States',
       'Newport Beach, California, United States',
       'Eindhoven, Noord-Brabant, The Netherlands',
       'Atlanta, Georgia, United States',
       'Los Angeles, California, United States',
       'Redwood Shores, California, United States',
       'Washington, District of Columbia, United States',
       'Guangzhou, Guangdong, China',
       'Cary, North Carolina, United States',
       'Oakland, California, United States',
       'Loveland, Ohio, United States',
       'Oxford, Oxfordshire, United Kingdom',
       'Kuala Lumpur, Kuala Lumpur, Malaysia',
       'Bentonville, Arkansas, United States',
       'Austin, Texas, United States',
       'Woodland Hills, California, United States',
       'Gurgaon, Haryana, India',
       'Redwood City, California, United States',
       'West Hollywood, California, United States',
       'Portland, Oregon, United States',
       'Burlington, Massachusetts, United States',
       'Miramar Beach, Florida, United States',
       'Corning, New York, United States',
       'Lake Buena Vista, Florida, United States',
       'Tallinn, Harjumaa, Estonia',
       'Stamford, Connecticut, United States',
       'Sisters, Oregon, United States',
       'Ellon, Aberdeenshire, United Kingdom',
       'Baltimore, Maryland, United States',
       'Cedar Park, Texas, United States',
       'Morehead, Kentucky, United States',
       'New City, New York, United States',
       'Santiago, Region Metropolitana, Chile',
       'Sai Wan, Hong Kong Island, Hong Kong',
       'Mainz, Rheinland-Pfalz, Germany', 'Milan, Lombardia, Italy',
       'Maastricht, Limburg, The Netherlands',
       'Las Vegas, Nevada, United States',
       'Gaithersburg, Maryland, United States',
       'Jakarta, Jakarta Raya, Indonesia',
       'Mclean, Virginia, United States', 'Karachi, Sindh, Pakistan',
       'München, Bayern, Germany', 'Provo, Utah, United States',
       'Faridabad, Haryana, India',
       'Wilmington, North Carolina, United States',
       'Burlingame, California, United States',
       'Foster City, California, United States',
       'Charlotte, North Carolina, United States',
       'Armonk, New York, United States',
       'Copenhagen, Hovedstaden, Denmark',
       'Wilmington, Delaware, United States', 'Tumkur, Karnataka, India',
       'Overland Park, Kansas, United States',
       'Herzliya, Tel Aviv, Israel', 'Logan, Utah, United States',
       'Brussels, Brussels Hoofdstedelijk Gewest, Belgium',
       'Zug, Zug, Switzerland', 'Cremona, Alberta, Canada',
       'Ohio, Illinois, United States',
       'Morrisville, North Carolina, United States',
       'Norwalk, Connecticut, United States',
       'Madison, Wisconsin, United States',
       'Wellington, Wellington, New Zealand',
       'San Carlos, California, United States',
       'Glen Waverley, Victoria, Australia',
       'Schaffhausen, Schaffhausen, Switzerland',
       'Ramat Gan, Tel Aviv, Israel',
       'Bromsgrove, Worcestershire, United Kingdom',
       'Venice, California, United States',
       'Bogotá, Distrito Especial, Colombia',
       'Salt Lake City, Utah, United States',
       'Mojave, California, United States',
       'Cambridge, Cambridgeshire, United Kingdom',
       'Townsville, Queensland, Australia',
       'Melbourne, Victoria, Australia',
       'Westerville, Ohio, United States',
       'Carpinteria, California, United States',
       'Schaumburg, Illinois, United States',
       'Coral Gables, Florida, United States',
       'Houston, Texas, United States', 'Cleveland, Ohio, United States',
       'Dallas, Texas, United States',
       'Raleigh, North Carolina, United States',
       'Omaha, Nebraska, United States', 'Grenoble, Rhone-Alpes, France',
       'Ann Arbor, Michigan, United States',
       'Millbrae, California, United States',
       'Kansas City, Missouri, United States',
       'Frankfurt, Hessen, Germany',
       'Leicester, Leicester, United Kingdom',
       'Daly City, California, United States',
       'Boise, Idaho, United States', 'Campina, Sao Paulo, Brazil',
       'Milwaukee, Wisconsin, United States', 'Hamburg, Hamburg, Germany',
       'Bothell, Washington, United States',
       'Petah Tiqva, HaMerkaz, Israel',
       'Burlington, North Carolina, United States',
       'Bath, Bath and North East Somerset, United Kingdom',
       'Tarrytown, New York, United States',
       'Manama, Al Manamah, Bahrain',
       'American Fork, Utah, United States',
       'Morris Plains, New Jersey, United States',
       'Jacksonville, Florida, United States', 'Haryana, Haryana, India',
       'Sumida, Tokyo, Japan', 'Draper, Utah, United States',
       'Buenos Aires, Distrito Federal, Argentina',
       'Issy-les-moulineaux, Ile-de-France, France',
       'Plantation, Florida, United States',
       'Silver Spring, Maryland, United States',
       'Greenville, South Carolina, United States',
       'Reston, Virginia, United States',
       'Livermore, California, United States',
       'Fremont, California, United States',
       'Novi, Michigan, United States',
       'Cheltenham, Gloucestershire, United Kingdom',
       'Hatfield, Hertford, United Kingdom',
       'Lakewood, Ohio, United States',
       'Seongnam, Kyonggi-do, South Korea',
       'Dubai, Dubai, United Arab Emirates',
       'Ljubljana, Ljubljana Urban Commune, Slovenia',
       'Sag Harbor, New York, United States',
       'Santa Cruz, California, United States',
       'Plymouth Meeting, Pennsylvania, United States',
       'Lehi, Utah, United States', 'Des Moines, Iowa, United States',
       'Fresno, California, United States',
       'Ness Ziona, HaMerkaz, Israel', 'Latham, New York, United States',
       'Vienna, Virginia, United States',
       'Winston Salem, North Carolina, United States',
       'Pasadena, California, United States',
       'Solihull, Solihull, United Kingdom',
       'Tangerang, Jawa Barat, Indonesia',
       'Westborough, Massachusetts, United States',
       'Dania, Florida, United States',
       'Detroit, Michigan, United States',
       'Lille, Nord-Pas-de-Calais, France',
       'Richardson, Texas, United States', 'Quebec, Quebec, Canada',
       'Rueil-malmaison, Ile-de-France, France',
       'Cedar Rapids, Iowa, United States', 'Geneva, Geneve, Switzerland',
       'Buffalo, New York, United States',
       'Lincolnshire, Illinois, United States',
       'Malmö, Skane Lan, Sweden', 'Nairobi, Nairobi Area, Kenya',
       'Swords, Dublin, Ireland', 'Walldorf, Baden-Wurttemberg, Germany',
       'Linköping, Ostergotlands Lan, Sweden',
       'Arvada, Colorado, United States',
       'Gardena, California, United States',
       'Belfair, Washington, United States',
       'Mendota, Minnesota, United States',
       'Farmington, Utah, United States'], dtype=object)

In [5]:
len(data['lat'].unique())

262

In [18]:
counts = data['long'].value_counts()
counts = pd.DataFrame(counts, index_col =0)
counts = counts.rename(columns = {"long":"counts"})
counts

TypeError: __init__() got an unexpected keyword argument 'index_col'

In [16]:
type(counts)

pandas.core.frame.DataFrame

In [15]:
dd = defaultdict(counts)

TypeError: first argument must be callable or None

In [12]:
counts.shape

(262, 1)

In [ ]:
counts_list = []
for lon in data['long']:
    if lon ==

In [15]:
counts

-122.419906    161
-74.006015     112
-0.127647       48
 77.591300      21
-122.083210     21
              ...
-1.788867        1
 24.745369       1
 114.134023      1
 127.126209      1
-111.929658      1
Name: long, Length: 262, dtype: int64